= Performance recommendations

- *Specify the target database on all queries* with the `database` parameter when creating new xref:transactions.adoc[sessions].
If no database is provided, the driver has to send an extra request to the server to figure out what the default database is.
The overhead is minimal for a single session, but becomes significant over hundreds of sessions.
+
[source,python,role=noheader]
----
# Good practice
driver.session(database="<DB NAME>")
----
+
[source,python,role=noheader]
----
# Bad practice
driver.session()
----

// - Execute as many queries within the same session.
Minimise the number of transactions?

- *Use xref:query-simple#query-parameters[query parameters]* instead of hardcoding or concatenating values into queries.
This allows the database to properly cache queries.
+
[source,python,role=noheader]
----
# Good practice
session.run("MATCH (p:Person {name: $name}) RETURN p", name="Alice")
----
+
[source,python,role=noheader]
----
# Bad practice
session.run("MATCH (p:Person {name: 'Alice'}) RETURN p")
session.run("MATCH (p:Person {name: " + name + "}) RETURN p")
----

- *Specify node labels* in all queries.
To learn how to combine labels, see link:{neo4j-docs-base-uri}/cypher-manual/current/syntax/expressions/#query-syntax-label[Cypher -- Label expressions].
+
[source,python,role=noheader]
----
# Good practice
session.run("MATCH (p:Person|Animal {name: $name}) RETURN p", name="Alice")
----
+
[source,python,role=noheader]
----
# Bad practice
session.run("MATCH (p {name: $name}) RETURN p", name="Alice")
----

- *Batch queries when creating a lot of records* using the link:{neo4j-docs-base-uri}/cypher-manual/current/clauses/with/[`WITH`] and link:{neo4j-docs-base-uri}/cypher-manual/current/clauses/unwind/[`UNWIND`] Cypher clauses.
+
[source,python,role=noheader]
----
# Good practice
numbers = [{"value": random()} for _ in range(10000)]
session.run("""
    WITH $numbers AS batch
    UNWIND batch AS node
    MERGE (n:Number)
    SET n.value = node.value
    """, numbers=numbers,
)
----
+
[source,python,role=noheader]
----
# Bad practice
for _ in range(10000):
    session.run("MERGE (:Number {value: $value})", value=random())
----
+
[TIP]
The most efficient way of performing a _first import_ of large amounts of data into a new database is the link:{neo4j-docs-base-uri}/operations-manual/current/tutorial/neo4j-admin-import/[`neo4j-admin database import`] command.
// source:  https://community.neo4j.com/t5/neo4j-graph-platform/improving-data-writing-efficiency-in-python/td-p/39520

- *Filter for properties inline*, as opposed to filtering in the link:{neo4j-docs-base-uri}/cypher-manual/current/clauses/with/[`WHERE`] clause.
+
[source,python,role=noheader]
----
# Good practice
session.run("MATCH (p:Person {name: $name}) RETURN p", name="Alice")
----
+
[source,python,role=noheader]
----
# Bad practice
session.run("MATCH (p:Person) WHERE p.name = $name RETURN p", name="Alice")
----

- *Create indexes for properties that you often filter against*.
For example, if you often look up `Person` nodes by the `name` property, it is beneficial to create an index on `Person.name`.
You can create indexes with the `CREATE INDEX` Cypher function, for both nodes and relationships.
For more information, see link:{neo4j-docs-base-uri}/cypher-manual/current/indexes-for-search-performance/[Indexes for search performance].
+
[source,python,role=noheader]
----
# Create an index on Person.name
session.run("CREATE INDEX person_name FOR (n:Person) ON (n.name)")
----

- link:{neo4j-docs-base-uri}/cypher-manual/current/query-tuning/basic-example/#_profile_query[*Profile your queries*] to locate queries whose performance can be improved.
You can profile queries by prepending them with `PROFILE`.
The server output is available in the `profile` property of the link:{neo4j-docs-base-uri}/api/python-driver/current/api.html#resultsummary[`ResultSummary`] object.
+
[source,python,role=noheader nocollapse]
----
res = session.run("PROFILE MATCH (p {name: $name}) RETURN p", name="Alice")
summary = res.consume()
print(summary.profile['args']['string-representation'])

"""
Planner COST
Runtime PIPELINED
Runtime version 5.0
Batch size 128

+-----------------+----------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator        | Details        | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-----------------+----------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults | p              |              1 |    1 |       3 |                |                        |           |                     |
| |               +----------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter         | p.name = $name |              1 |    1 |       4 |                |                        |           |                     |
| |               +----------------+----------------+------+---------+----------------+                        |           |                     |
| +AllNodesScan   | p              |             10 |    4 |       5 |            120 |                 9160/0 |   108.923 | Fused in Pipeline 0 |
+-----------------+----------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 12, total allocated memory: 184
"""
----
+
In case some queries are so slow that you are unable to even run them in reasonable times, you can prepend them with `EXPLAIN` instead of `PROFILE`.
This will return the _plan_ that the server would use to run the query, but without executing it.
The server output is available in the `plan` property of the link:{neo4j-docs-base-uri}/api/python-driver/current/api.html#resultsummary[`ResultSummary`] object.
+
[source,python,role=noheader nocollapse]
----
res = session.run("EXPLAIN MATCH (p {name: $name}) RETURN p", name="Alice")
summary = res.consume()
print(summary.plan['args']['string-representation'])

"""
Planner COST
Runtime PIPELINED
Runtime version 5.0
Batch size 128

+-----------------+----------------+----------------+---------------------+
| Operator        | Details        | Estimated Rows | Pipeline            |
+-----------------+----------------+----------------+---------------------+
| +ProduceResults | p              |              1 |                     |
| |               +----------------+----------------+                     |
| +Filter         | p.name = $name |              1 |                     |
| |               +----------------+----------------+                     |
| +AllNodesScan   | p              |             10 | Fused in Pipeline 0 |
+-----------------+----------------+----------------+---------------------+

Total database accesses: ?
"""
----

- *Use xref:concurrency.adoc[concurrency]*, either in the form of multithreading or with the async version of the driver.
This is likely to be more impactful on performance if you parallelize complex and time-consuming queries in your application, but not so much if you run many simple ones.

// - with SET, specify individual properties one by one instead of using += (too low impact)


[discrete.glossary]
== Glossary

include::{common-partial}/glossary.adoc[]
