= Performance recommendations

== Always specify the target database

*Specify the target database on all queries* using the `database` parameter, both in xref:query-simple.adoc[`Driver.executeQuery()`] calls and when creating new xref:transactions.adoc[sessions].
If no database is provided, the driver has to send an extra request to the server to figure out what the default database is.
The overhead is minimal for a single query, but becomes significant over hundreds of them.

[discrete]
=== Good practices

[source, javascript]
----
driver.executeQuery('<QUERY>', {}, {database: '<DB NAME>'})
----

[source, javascript]
----
driver.session({database: '<DB NAME>'})
----

[discrete]
=== Bad practices

[source, javascript]
----
driver.executeQuery('<QUERY>')
----

[source, javascript]
----
driver.session()
----

== Use query parameters

*Use xref:query-simple#query-parameters[query parameters]* instead of hardcoding or concatenating values into queries.
This allows to leverage the database's query cache.

[discrete]
=== Good practices

[source, javascript]
----
driver.executeQuery(
  'MATCH (p:Person {name: $name}) RETURN p',
  { name: 'Alice' }  // query parameters
)
----

[source, javascript]
----
let session = driver.session({database: '<DB NAME>'})
session.run(
  'MATCH (p:Person {name: $name}) RETURN p',
  { name: 'Alice' }  // query parameters
)
----

[discrete]
=== Bad practices

[source, javascript]
----
driver.executeQuery('MATCH (p:Person {name: "Alice"}) RETURN p')
driver.executeQuery('MATCH (p:Person {name: ' + name + '}) RETURN p')
----

[source, javascript]
----
let session = driver.session({database: '<DB NAME>'})
session.run(
  'MATCH (p:Person {name: "Alice"}) RETURN p',
  // or 'MATCH (p:Person {name: ' + name + '}) RETURN p'
  {}
)
----


== Specify node labels

*Specify node labels* in all queries.
To learn how to combine labels, see link:{neo4j-docs-base-uri}/cypher-manual/current/syntax/expressions/#query-syntax-label[Cypher -- Label expressions].

[discrete]
=== Good practices

[source, javascript]
----
driver.executeQuery(
  'MATCH (p:Person|Animal {name: $name}) RETURN p',
  { name: 'Alice' }
)
----

[source, javascript]
----
let session = driver.session({database: '<DB NAME>'})
session.run(
  'MATCH (p:Person|Animal {name: $name}) RETURN p',
  { name: 'Alice' }
)
----

[discrete]
=== Bad practices

[source, javascript]
----
driver.executeQuery(
  'MATCH (p {name: $name}) RETURN p',
  { name: 'Alice' }
)
----

[source, javascript]
----
let session = driver.session({database: '<DB NAME>'})
session.run(
  'MATCH (p {name: $name}) RETURN p',
  { name: 'Alice' }
)
----


== Batch data creation

*Batch queries when creating a lot of records* using the link:{neo4j-docs-base-uri}/cypher-manual/current/clauses/with/[`WITH`] and link:{neo4j-docs-base-uri}/cypher-manual/current/clauses/unwind/[`UNWIND`] Cypher clauses.

[discrete]
=== Good practice

[source, javascript]
----
numbers = []
for(let i=0; i<10000; i++) {
  numbers.push({value: Math.random()})
}
driver.executeQuery(`
    WITH $numbers AS batch
    UNWIND batch AS node
    MERGE (n:Number {value: node.value})
    `, { numbers: numbers }
)
----

[discrete]
=== Bad practice

[source, javascript]
----
// Bad practice
for(let i=0; i<10000; i++) {
  driver.executeQuery('MERGE (:Number {value: $value})', { value: Math.random() })
}
----

[TIP]
The most efficient way of performing a _first import_ of large amounts of data into a new database is the link:{neo4j-docs-base-uri}/operations-manual/current/tutorial/neo4j-admin-import/[`neo4j-admin database import`] command.
// source:  https://community.neo4j.com/t5/neo4j-graph-platform/improving-data-writing-efficiency-in-python/td-p/39520


== Route read queries to cluster readers

In a cluster, *route read queries to link:{neo4j-docs-base-uri}/operations-manual/current/clustering/introduction/#clustering-secondary-mode[secondary nodes]*. You do this by:

- setting the xref:query-simple.adoc#_request_routing[`routing: READ` as configuration in `Driver.executeQuery()`] calls
- using `Session.executeRead()` instead of `Session.executeWrite()` (for managed transactions)
- setting xref:transactions.adoc#_request_routing[`AccessMode: neo4j.AccessModeRead` when creating a new session] (for explicit transactions).

[discrete]
=== Good practices

[source, javascript]
----
driver.executeQuery(
  'MATCH (p:Person) RETURN p.name',
  {},
  {
    routing: 'READ',  // short for neo4j.routing.READ
    database: 'neo4j'
  }
)
----

[source, javascript]
----
let session = driver.session({ database: 'neo4j' })
await session.executeRead(async tx => {
  return await tx.run('MATCH (p:Person) RETURN p.name', {})
})
----


[discrete]
=== Bad practices

[source, javascript]
----
driver.executeQuery(
  'MATCH (p:Person) RETURN p.name',
  {},
  {
    database: 'neo4j'
  }
)
// defaults to routing = writers
----

[source, javascript]
----
let session = driver.session({ database: 'neo4j' })
await session.executeRead(async tx => {
  return await tx.run('MATCH (p:Person) RETURN p.name', {})
})
// don't ask to write on a read-only operation
----


== Create indexes

*Create indexes for properties that you often filter against*.
For example, if you often look up `Person` nodes by the `name` property, it is beneficial to create an index on `Person.name`.
You can create indexes with the `CREATE INDEX` Cypher function, for both nodes and relationships.
For more information, see link:{neo4j-docs-base-uri}/cypher-manual/current/indexes-for-search-performance/[Indexes for search performance].

[source, javascript]
----
// Create an index on Person.name
driver.executeQuery('CREATE INDEX personName FOR (n:Person) ON (n.name)')
----


== Profile queries

link:{neo4j-docs-base-uri}/cypher-manual/current/query-tuning/basic-example/#_profile_query[*Profile your queries*] to locate queries whose performance can be improved.
You can profile queries by prepending them with `PROFILE`.
The server output is available in the `profile` property of the xref:result-summary.adoc[`ResultSummary`] object.

[source, javascript, role=nocollapse]
----
const result = driver.executeQuery('PROFILE MATCH (p {name: $name}) RETURN p', { name: 'Alice' })
console.log(result.summary.profile.arguments['string-representation'])
/*
Planner COST
Runtime PIPELINED
Runtime version 5.0
Batch size 128

+-----------------+----------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator        | Details        | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-----------------+----------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults | p              |              1 |    1 |       3 |                |                        |           |                     |
| |               +----------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter         | p.name = $name |              1 |    1 |       4 |                |                        |           |                     |
| |               +----------------+----------------+------+---------+----------------+                        |           |                     |
| +AllNodesScan   | p              |             10 |    4 |       5 |            120 |                 9160/0 |   108.923 | Fused in Pipeline 0 |
+-----------------+----------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 12, total allocated memory: 184
*/
----

If your query is so slow that you are unable to even run it in a reasonable time, you can prepend it with `EXPLAIN` instead of `PROFILE`.
This will return the _plan_ that the server would use to run the query, but without executing it.
The server output is available in the `plan` property of the xref:result-summary.adoc[`ResultSummary`] object.

[source, javascript, role=nocollapse]
----
const result = driver.executeQuery('EXPLAIN MATCH (p {name: $name}) RETURN p', { name: 'Alice' })
console.log(result.summary.plan.arguments['string-representation'])
/*
Planner COST
Runtime PIPELINED
Runtime version 5.0
Batch size 128

+-----------------+----------------+----------------+---------------------+
| Operator        | Details        | Estimated Rows | Pipeline            |
+-----------------+----------------+----------------+---------------------+
| +ProduceResults | p              |              1 |                     |
| |               +----------------+----------------+                     |
| +Filter         | p.name = $name |              1 |                     |
| |               +----------------+----------------+                     |
| +AllNodesScan   | p              |             10 | Fused in Pipeline 0 |
+-----------------+----------------+----------------+---------------------+

Total database accesses: ?
*/
----


== Concurrency

*Use xref:query-async.adoc[asynchronous querying]*.
This is likely to be more impactful on performance if you parallelize complex and time-consuming queries in your application, but not so much if you run many simple ones.


== Filter notifications

xref:result-summary.adoc#_filter_notifications[Filter the category and/or severity of notifications] the server should raise.


ifndef::backend-pdf[]
[discrete.glossary]
== Glossary

include::{common-partial}/glossary.adoc[]
include::../partials/glossary.adoc[]
endif::[]
